MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ32GS606/mcu.h
#define _LEBDLY6_LEB7_POSITION                   0x0000000A
#define _LEBDLY6_LEB7_MASK                       0x00000400
#define _LEBDLY6_LEB7_LENGTH                     0x00000001

#define _LEBDLY6_LEB8_POSITION                   0x0000000B
#define _LEBDLY6_LEB8_MASK                       0x00000800
#define _LEBDLY6_LEB8_LENGTH                     0x00000001

#define _AUXCON6_CHOPLEN_POSITION                0x00000000
#define _AUXCON6_CHOPLEN_MASK                    0x00000001
#define _AUXCON6_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON6_CHOPHEN_POSITION                0x00000001
#define _AUXCON6_CHOPHEN_MASK                    0x00000002
#define _AUXCON6_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON6_CHOPSEL_POSITION                0x00000002
#define _AUXCON6_CHOPSEL_MASK                    0x0000003C
#define _AUXCON6_CHOPSEL_LENGTH                  0x00000004

#define _AUXCON6_BLANKSEL_POSITION               0x00000008
#define _AUXCON6_BLANKSEL_MASK                   0x00000F00
#define _AUXCON6_BLANKSEL_LENGTH                 0x00000004

#define _AUXCON6_HRDDIS_POSITION                 0x0000000E
#define _AUXCON6_HRDDIS_MASK                     0x00004000
#define _AUXCON6_HRDDIS_LENGTH                   0x00000001

#define _AUXCON6_HRPDIS_POSITION                 0x0000000F
#define _AUXCON6_HRPDIS_MASK                     0x00008000
#define _AUXCON6_HRPDIS_LENGTH                   0x00000001

#define _AUXCON6_CHOPSEL0_POSITION               0x00000002
#define _AUXCON6_CHOPSEL0_MASK                   0x00000004
#define _AUXCON6_CHOPSEL0_LENGTH                 0x00000001

#define _AUXCON6_CHOPSEL1_POSITION               0x00000003
#define _AUXCON6_CHOPSEL1_MASK                   0x00000008
#define _AUXCON6_CHOPSEL1_LENGTH                 0x00000001

#define _AUXCON6_CHOPSEL2_POSITION               0x00000004
#define _AUXCON6_CHOPSEL2_MASK                   0x00000010
#define _AUXCON6_CHOPSEL2_LENGTH                 0x00000001

#define _AUXCON6_CHOPSEL3_POSITION               0x00000005
#define _AUXCON6_CHOPSEL3_MASK                   0x00000020
#define _AUXCON6_CHOPSEL3_LENGTH                 0x00000001

#define _AUXCON6_BLANKSEL0_POSITION              0x00000008
#define _AUXCON6_BLANKSEL0_MASK                  0x00000100
#define _AUXCON6_BLANKSEL0_LENGTH                0x00000001

#define _AUXCON6_BLANKSEL1_POSITION              0x00000009
#define _AUXCON6_BLANKSEL1_MASK                  0x00000200
#define _AUXCON6_BLANKSEL1_LENGTH                0x00000001

#define _AUXCON6_BLANKSEL2_POSITION              0x0000000A
#define _AUXCON6_BLANKSEL2_MASK                  0x00000400
#define _AUXCON6_BLANKSEL2_LENGTH                0x00000001

#define _AUXCON6_BLANKSEL3_POSITION              0x0000000B
#define _AUXCON6_BLANKSEL3_MASK                  0x00000800
#define _AUXCON6_BLANKSEL3_LENGTH                0x00000001

#define _CMPCON1_RANGE_POSITION                  0x00000000
#define _CMPCON1_RANGE_MASK                      0x00000001
#define _CMPCON1_RANGE_LENGTH                    0x00000001

#define _CMPCON1_CMPPOL_POSITION                 0x00000001
#define _CMPCON1_CMPPOL_MASK                     0x00000002
#define _CMPCON1_CMPPOL_LENGTH                   0x00000001

#define _CMPCON1_CMPSTAT_POSITION                0x00000003
#define _CMPCON1_CMPSTAT_MASK                    0x00000008
#define _CMPCON1_CMPSTAT_LENGTH                  0x00000001

#define _CMPCON1_EXTREF_POSITION                 0x00000005
#define _CMPCON1_EXTREF_MASK                     0x00000020
#define _CMPCON1_EXTREF_LENGTH                   0x00000001

#define _CMPCON1_INSEL_POSITION                  0x00000006
#define _CMPCON1_INSEL_MASK                      0x000000C0
#define _CMPCON1_INSEL_LENGTH                    0x00000002

#define _CMPCON1_DACOE_POSITION                  0x00000008
#define _CMPCON1_DACOE_MASK                      0x00000100
#define _CMPCON1_DACOE_LENGTH                    0x00000001

#define _CMPCON1_CMPSIDL_POSITION                0x0000000D
#define _CMPCON1_CMPSIDL_MASK                    0x00002000
#define _CMPCON1_CMPSIDL_LENGTH                  0x00000001

#define _CMPCON1_CMPON_POSITION                  0x0000000F
#define _CMPCON1_CMPON_MASK                      0x00008000
#define _CMPCON1_CMPON_LENGTH                    0x00000001

#define _CMPCON1_INSEL0_POSITION                 0x00000006
#define _CMPCON1_INSEL0_MASK                     0x00000040
#define _CMPCON1_INSEL0_LENGTH                   0x00000001

#define _CMPCON1_INSEL1_POSITION                 0x00000007
#define _CMPCON1_INSEL1_MASK                     0x00000080
#define _CMPCON1_INSEL1_LENGTH                   0x00000001

#define _CMPDAC1_CMREF_POSITION                  0x00000000
#define _CMPDAC1_CMREF_MASK                      0x000003FF
#define _CMPDAC1_CMREF_LENGTH                    0x0000000A

#define _CMPDAC1_CMREF0_POSITION                 0x00000000
#define _CMPDAC1_CMREF0_MASK                     0x00000001
#define _CMPDAC1_CMREF0_LENGTH                   0x00000001

#define _CMPDAC1_CMREF1_POSITION                 0x00000001
#define _CMPDAC1_CMREF1_MASK                     0x00000002
#define _CMPDAC1_CMREF1_LENGTH                   0x00000001

#define _CMPDAC1_CMREF2_POSITION                 0x00000002
#define _CMPDAC1_CMREF2_MASK                     0x00000004
#define _CMPDAC1_CMREF2_LENGTH                   0x00000001

#define _CMPDAC1_CMREF3_POSITION                 0x00000003
#define _CMPDAC1_CMREF3_MASK                     0x00000008
#define _CMPDAC1_CMREF3_LENGTH                   0x00000001

#define _CMPDAC1_CMREF4_POSITION                 0x00000004
#define _CMPDAC1_CMREF4_MASK                     0x00000010
#define _CMPDAC1_CMREF4_LENGTH                   0x00000001

#define _CMPDAC1_CMREF5_POSITION                 0x00000005
#define _CMPDAC1_CMREF5_MASK                     0x00000020
#define _CMPDAC1_CMREF5_LENGTH                   0x00000001

#define _CMPDAC1_CMREF6_POSITION                 0x00000006
#define _CMPDAC1_CMREF6_MASK                     0x00000040
#define _CMPDAC1_CMREF6_LENGTH                   0x00000001

#define _CMPDAC1_CMREF7_POSITION                 0x00000007
#define _CMPDAC1_CMREF7_MASK                     0x00000080
#define _CMPDAC1_CMREF7_LENGTH                   0x00000001

#define _CMPDAC1_CMREF8_POSITION                 0x00000008
#define _CMPDAC1_CMREF8_MASK                     0x00000100
#define _CMPDAC1_CMREF8_LENGTH                   0x00000001

#define _CMPDAC1_CMREF9_POSITION                 0x00000009
#define _CMPDAC1_CMREF9_MASK                     0x00000200
#define _CMPDAC1_CMREF9_LENGTH                   0x00000001

#define _CMPCON2_RANGE_POSITION                  0x00000000
#define _CMPCON2_RANGE_MASK                      0x00000001
#define _CMPCON2_RANGE_LENGTH                    0x00000001

#define _CMPCON2_CMPPOL_POSITION                 0x00000001
#define _CMPCON2_CMPPOL_MASK                     0x00000002
#define _CMPCON2_CMPPOL_LENGTH                   0x00000001

#define _CMPCON2_CMPSTAT_POSITION                0x00000003
#define _CMPCON2_CMPSTAT_MASK                    0x00000008
#define _CMPCON2_CMPSTAT_LENGTH                  0x00000001

