MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ32GS606/mcu.h
#define _CMPCON4_EXTREF_POSITION                 0x00000005
#define _CMPCON4_EXTREF_MASK                     0x00000020
#define _CMPCON4_EXTREF_LENGTH                   0x00000001

#define _CMPCON4_INSEL_POSITION                  0x00000006
#define _CMPCON4_INSEL_MASK                      0x000000C0
#define _CMPCON4_INSEL_LENGTH                    0x00000002

#define _CMPCON4_DACOE_POSITION                  0x00000008
#define _CMPCON4_DACOE_MASK                      0x00000100
#define _CMPCON4_DACOE_LENGTH                    0x00000001

#define _CMPCON4_CMPSIDL_POSITION                0x0000000D
#define _CMPCON4_CMPSIDL_MASK                    0x00002000
#define _CMPCON4_CMPSIDL_LENGTH                  0x00000001

#define _CMPCON4_CMPON_POSITION                  0x0000000F
#define _CMPCON4_CMPON_MASK                      0x00008000
#define _CMPCON4_CMPON_LENGTH                    0x00000001

#define _CMPCON4_INSEL0_POSITION                 0x00000006
#define _CMPCON4_INSEL0_MASK                     0x00000040
#define _CMPCON4_INSEL0_LENGTH                   0x00000001

#define _CMPCON4_INSEL1_POSITION                 0x00000007
#define _CMPCON4_INSEL1_MASK                     0x00000080
#define _CMPCON4_INSEL1_LENGTH                   0x00000001

#define _CMPDAC4_CMREF_POSITION                  0x00000000
#define _CMPDAC4_CMREF_MASK                      0x000003FF
#define _CMPDAC4_CMREF_LENGTH                    0x0000000A

#define _CMPDAC4_CMREF0_POSITION                 0x00000000
#define _CMPDAC4_CMREF0_MASK                     0x00000001
#define _CMPDAC4_CMREF0_LENGTH                   0x00000001

#define _CMPDAC4_CMREF1_POSITION                 0x00000001
#define _CMPDAC4_CMREF1_MASK                     0x00000002
#define _CMPDAC4_CMREF1_LENGTH                   0x00000001

#define _CMPDAC4_CMREF2_POSITION                 0x00000002
#define _CMPDAC4_CMREF2_MASK                     0x00000004
#define _CMPDAC4_CMREF2_LENGTH                   0x00000001

#define _CMPDAC4_CMREF3_POSITION                 0x00000003
#define _CMPDAC4_CMREF3_MASK                     0x00000008
#define _CMPDAC4_CMREF3_LENGTH                   0x00000001

#define _CMPDAC4_CMREF4_POSITION                 0x00000004
#define _CMPDAC4_CMREF4_MASK                     0x00000010
#define _CMPDAC4_CMREF4_LENGTH                   0x00000001

#define _CMPDAC4_CMREF5_POSITION                 0x00000005
#define _CMPDAC4_CMREF5_MASK                     0x00000020
#define _CMPDAC4_CMREF5_LENGTH                   0x00000001

#define _CMPDAC4_CMREF6_POSITION                 0x00000006
#define _CMPDAC4_CMREF6_MASK                     0x00000040
#define _CMPDAC4_CMREF6_LENGTH                   0x00000001

#define _CMPDAC4_CMREF7_POSITION                 0x00000007
#define _CMPDAC4_CMREF7_MASK                     0x00000080
#define _CMPDAC4_CMREF7_LENGTH                   0x00000001

#define _CMPDAC4_CMREF8_POSITION                 0x00000008
#define _CMPDAC4_CMREF8_MASK                     0x00000100
#define _CMPDAC4_CMREF8_LENGTH                   0x00000001

#define _CMPDAC4_CMREF9_POSITION                 0x00000009
#define _CMPDAC4_CMREF9_MASK                     0x00000200
#define _CMPDAC4_CMREF9_LENGTH                   0x00000001

#define _RCON_POR_POSITION                       0x00000000
#define _RCON_POR_MASK                           0x00000001
#define _RCON_POR_LENGTH                         0x00000001

#define _RCON_BOR_POSITION                       0x00000001
#define _RCON_BOR_MASK                           0x00000002
#define _RCON_BOR_LENGTH                         0x00000001

#define _RCON_IDLE_POSITION                      0x00000002
#define _RCON_IDLE_MASK                          0x00000004
#define _RCON_IDLE_LENGTH                        0x00000001

#define _RCON_SLEEP_POSITION                     0x00000003
#define _RCON_SLEEP_MASK                         0x00000008
#define _RCON_SLEEP_LENGTH                       0x00000001

#define _RCON_WDTO_POSITION                      0x00000004
#define _RCON_WDTO_MASK                          0x00000010
#define _RCON_WDTO_LENGTH                        0x00000001

#define _RCON_SWDTEN_POSITION                    0x00000005
#define _RCON_SWDTEN_MASK                        0x00000020
#define _RCON_SWDTEN_LENGTH                      0x00000001

#define _RCON_SWR_POSITION                       0x00000006
#define _RCON_SWR_MASK                           0x00000040
#define _RCON_SWR_LENGTH                         0x00000001

#define _RCON_EXTR_POSITION                      0x00000007
#define _RCON_EXTR_MASK                          0x00000080
#define _RCON_EXTR_LENGTH                        0x00000001

#define _RCON_VREGS_POSITION                     0x00000008
#define _RCON_VREGS_MASK                         0x00000100
#define _RCON_VREGS_LENGTH                       0x00000001

#define _RCON_IOPUWR_POSITION                    0x0000000E
#define _RCON_IOPUWR_MASK                        0x00004000
#define _RCON_IOPUWR_LENGTH                      0x00000001

#define _RCON_TRAPR_POSITION                     0x0000000F
#define _RCON_TRAPR_MASK                         0x00008000
#define _RCON_TRAPR_LENGTH                       0x00000001

#define _OSCCON_OSWEN_POSITION                   0x00000000
#define _OSCCON_OSWEN_MASK                       0x00000001
#define _OSCCON_OSWEN_LENGTH                     0x00000001

#define _OSCCON_LPOSCEN_POSITION                 0x00000001
#define _OSCCON_LPOSCEN_MASK                     0x00000002
#define _OSCCON_LPOSCEN_LENGTH                   0x00000001

#define _OSCCON_CF_POSITION                      0x00000003
#define _OSCCON_CF_MASK                          0x00000008
#define _OSCCON_CF_LENGTH                        0x00000001

#define _OSCCON_PRCDEN_POSITION                  0x00000004
#define _OSCCON_PRCDEN_MASK                      0x00000010
#define _OSCCON_PRCDEN_LENGTH                    0x00000001

#define _OSCCON_LOCK_POSITION                    0x00000005
#define _OSCCON_LOCK_MASK                        0x00000020
#define _OSCCON_LOCK_LENGTH                      0x00000001

#define _OSCCON_CLKLOCK_POSITION                 0x00000007
#define _OSCCON_CLKLOCK_MASK                     0x00000080
#define _OSCCON_CLKLOCK_LENGTH                   0x00000001

#define _OSCCON_NOSC_POSITION                    0x00000008
#define _OSCCON_NOSC_MASK                        0x00000700
#define _OSCCON_NOSC_LENGTH                      0x00000003

#define _OSCCON_COSC_POSITION                    0x0000000C
#define _OSCCON_COSC_MASK                        0x00007000
#define _OSCCON_COSC_LENGTH                      0x00000003

