MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ32GS606/mcu.h
#define _PLLFBD_PLLDIV8_POSITION                 0x00000008
#define _PLLFBD_PLLDIV8_MASK                     0x00000100
#define _PLLFBD_PLLDIV8_LENGTH                   0x00000001

#define _OSCTUN_TUN_POSITION                     0x00000000
#define _OSCTUN_TUN_MASK                         0x0000003F
#define _OSCTUN_TUN_LENGTH                       0x00000006

#define _OSCTUN_TUN0_POSITION                    0x00000000
#define _OSCTUN_TUN0_MASK                        0x00000001
#define _OSCTUN_TUN0_LENGTH                      0x00000001

#define _OSCTUN_TUN1_POSITION                    0x00000001
#define _OSCTUN_TUN1_MASK                        0x00000002
#define _OSCTUN_TUN1_LENGTH                      0x00000001

#define _OSCTUN_TUN2_POSITION                    0x00000002
#define _OSCTUN_TUN2_MASK                        0x00000004
#define _OSCTUN_TUN2_LENGTH                      0x00000001

#define _OSCTUN_TUN3_POSITION                    0x00000003
#define _OSCTUN_TUN3_MASK                        0x00000008
#define _OSCTUN_TUN3_LENGTH                      0x00000001

#define _OSCTUN_TSEQ10_POSITION                  0x00000004
#define _OSCTUN_TSEQ10_MASK                      0x00000010
#define _OSCTUN_TSEQ10_LENGTH                    0x00000001

#define _OSCTUN_TSEQ11_POSITION                  0x00000005
#define _OSCTUN_TSEQ11_MASK                      0x00000020
#define _OSCTUN_TSEQ11_LENGTH                    0x00000001

#define _OSCTUN_TSEQ12_POSITION                  0x00000006
#define _OSCTUN_TSEQ12_MASK                      0x00000040
#define _OSCTUN_TSEQ12_LENGTH                    0x00000001

#define _OSCTUN_TSEQ13_POSITION                  0x00000007
#define _OSCTUN_TSEQ13_MASK                      0x00000080
#define _OSCTUN_TSEQ13_LENGTH                    0x00000001

#define _OSCTUN_TSEQ20_POSITION                  0x00000008
#define _OSCTUN_TSEQ20_MASK                      0x00000100
#define _OSCTUN_TSEQ20_LENGTH                    0x00000001

#define _OSCTUN_TSEQ21_POSITION                  0x00000009
#define _OSCTUN_TSEQ21_MASK                      0x00000200
#define _OSCTUN_TSEQ21_LENGTH                    0x00000001

#define _OSCTUN_TSEQ22_POSITION                  0x0000000A
#define _OSCTUN_TSEQ22_MASK                      0x00000400
#define _OSCTUN_TSEQ22_LENGTH                    0x00000001

#define _OSCTUN_TSEQ23_POSITION                  0x0000000B
#define _OSCTUN_TSEQ23_MASK                      0x00000800
#define _OSCTUN_TSEQ23_LENGTH                    0x00000001

#define _OSCTUN_TSEQ30_POSITION                  0x0000000C
#define _OSCTUN_TSEQ30_MASK                      0x00001000
#define _OSCTUN_TSEQ30_LENGTH                    0x00000001

#define _OSCTUN_TSEQ31_POSITION                  0x0000000D
#define _OSCTUN_TSEQ31_MASK                      0x00002000
#define _OSCTUN_TSEQ31_LENGTH                    0x00000001

#define _OSCTUN_TSEQ32_POSITION                  0x0000000E
#define _OSCTUN_TSEQ32_MASK                      0x00004000
#define _OSCTUN_TSEQ32_LENGTH                    0x00000001

#define _OSCTUN_TSEQ33_POSITION                  0x0000000F
#define _OSCTUN_TSEQ33_MASK                      0x00008000
#define _OSCTUN_TSEQ33_LENGTH                    0x00000001

#define _OSCTUN2_TSEQ40_POSITION                 0x00000000
#define _OSCTUN2_TSEQ40_MASK                     0x00000001
#define _OSCTUN2_TSEQ40_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ41_POSITION                 0x00000001
#define _OSCTUN2_TSEQ41_MASK                     0x00000002
#define _OSCTUN2_TSEQ41_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ42_POSITION                 0x00000002
#define _OSCTUN2_TSEQ42_MASK                     0x00000004
#define _OSCTUN2_TSEQ42_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ43_POSITION                 0x00000003
#define _OSCTUN2_TSEQ43_MASK                     0x00000008
#define _OSCTUN2_TSEQ43_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ50_POSITION                 0x00000004
#define _OSCTUN2_TSEQ50_MASK                     0x00000010
#define _OSCTUN2_TSEQ50_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ51_POSITION                 0x00000005
#define _OSCTUN2_TSEQ51_MASK                     0x00000020
#define _OSCTUN2_TSEQ51_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ52_POSITION                 0x00000006
#define _OSCTUN2_TSEQ52_MASK                     0x00000040
#define _OSCTUN2_TSEQ52_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ53_POSITION                 0x00000007
#define _OSCTUN2_TSEQ53_MASK                     0x00000080
#define _OSCTUN2_TSEQ53_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ60_POSITION                 0x00000008
#define _OSCTUN2_TSEQ60_MASK                     0x00000100
#define _OSCTUN2_TSEQ60_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ61_POSITION                 0x00000009
#define _OSCTUN2_TSEQ61_MASK                     0x00000200
#define _OSCTUN2_TSEQ61_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ62_POSITION                 0x0000000A
#define _OSCTUN2_TSEQ62_MASK                     0x00000400
#define _OSCTUN2_TSEQ62_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ63_POSITION                 0x0000000B
#define _OSCTUN2_TSEQ63_MASK                     0x00000800
#define _OSCTUN2_TSEQ63_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ70_POSITION                 0x0000000C
#define _OSCTUN2_TSEQ70_MASK                     0x00001000
#define _OSCTUN2_TSEQ70_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ71_POSITION                 0x0000000D
#define _OSCTUN2_TSEQ71_MASK                     0x00002000
#define _OSCTUN2_TSEQ71_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ72_POSITION                 0x0000000E
#define _OSCTUN2_TSEQ72_MASK                     0x00004000
#define _OSCTUN2_TSEQ72_LENGTH                   0x00000001

#define _OSCTUN2_TSEQ73_POSITION                 0x0000000F
#define _OSCTUN2_TSEQ73_MASK                     0x00008000
#define _OSCTUN2_TSEQ73_LENGTH                   0x00000001

#define _REFOCON_RODIV_POSITION                  0x00000008
#define _REFOCON_RODIV_MASK                      0x00000F00
#define _REFOCON_RODIV_LENGTH                    0x00000004

