MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ32GS606/mcu.h
/*
** Only one invocation of FPOR should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPOR.
** Multiple options may be combined, as shown:
**
** _FPOR( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   POR Timer Value:
**     FPWRT_PWR1           Disabled
**     FPWRT_PWR2           2ms
**     FPWRT_PWR4           4ms
**     FPWRT_PWR8           8ms
**     FPWRT_PWR16          16ms
**     FPWRT_PWR32          32ms
**     FPWRT_PWR64          64ms
**     FPWRT_PWR128         128ms
**
**   Enable Alternate SS1 pin bit:
**     ALTSS1_OFF           SS1 is selected as the I/O pin for SPI1
**     ALTSS1_ON            SS1A is selected as the I/O pin for SPI1
**
**   Enable Alternate QEI1 pin bit:
**     ALTQIO_ON            AQEA1, AQEB1, and AINDX1 are selected as inputs to QEI1
**     ALTQIO_OFF           QEA1, QEB1, INDX1 are selected as inputs to QEI1
**
*/

#define FPWRT_PWR1           0x0060
#define FPWRT_PWR2           0x0061
#define FPWRT_PWR4           0x0062
#define FPWRT_PWR8           0x0063
#define FPWRT_PWR16          0x0064
#define FPWRT_PWR32          0x0065
#define FPWRT_PWR64          0x0066
#define FPWRT_PWR128         0x0067

#define ALTSS1_OFF           0x0047
#define ALTSS1_ON            0x0067

#define ALTQIO_ON            0x0027
#define ALTQIO_OFF           0x0067

/* Register FICD (0xf8000e)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FICD;
#define _FICD(x) __attribute__((address(0xf8000e),deprecated_definition("consider migrating to #pragma config"),section("__FICD.sec"),space(prog))) __prog__ uint16_t _FICD = (x);

/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Comm Channel Select:
**     ICS_NONE             Reserved, do not use
**     ICS_PGD3             Communicate on PGC3/EMUC3 and PGD3/EMUD3
**     ICS_PGD2             Communicate on PGC2/EMUC2 and PGD2/EMUD2
**     ICS_PGD1             Communicate on PGC1/EMUC1 and PGD1/EMUD1
**
**   JTAG Port Enable:
**     JTAGEN_OFF           JTAG is disabled
**     JTAGEN_ON            JTAG is enabled
**
*/

#define ICS_NONE             0x00E0
#define ICS_PGD3             0x00E1
#define ICS_PGD2             0x00E2
#define ICS_PGD1             0x00E3

#define JTAGEN_OFF           0x00C3
#define JTAGEN_ON            0x00E3

/* Register FCMP (0xf80010)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FCMP;
#define _FCMP(x) __attribute__((address(0xf80010),deprecated_definition("consider migrating to #pragma config"),section("__FCMP.sec"),space(prog))) __prog__ uint16_t _FCMP = (x);

/*
** Only one invocation of FCMP should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FCMP.
** Multiple options may be combined, as shown:
**
** _FCMP( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Even Comparator Hysteresis Select:
**     HYST0_HYST0          No Hysteresis
**     HYST0_HYST15         15 mV Hysteresis
**     HYST0_HYST30         30 mV Hysteresis
**     HYST0_HYST45         45 mV Hysteresis
**
**   Comparator Hysteresis Polarity (for even numbered comparators):
**     CMPPOL0_POL_RISE     Hysteresis is applied to rising edge
**     CMPPOL0_POL_FALL     Hysteresis is applied to falling edge
**
**   Odd Comparator Hysteresis Select:
**     HYST1_HYST0          No Hysteresis
**     HYST1_HYST15         15 mV Hysteresis
**     HYST1_HYST30         30 mV Hysteresis
**     HYST1_HYST45         45 mV Hysteresis
**
**   Comparator Hysteresis Polarity (for odd numbered comparators):
**     CMPPOL1_POL_RISE     Hysteresis is applied to rising edge
**     CMPPOL1_POL_FALL     Hysteresis is applied to falling edge
**
*/

#define HYST0_HYST0          0x003C
#define HYST0_HYST15         0x003D
#define HYST0_HYST30         0x003E
#define HYST0_HYST45         0x003F

#define CMPPOL0_POL_RISE     0x003B
#define CMPPOL0_POL_FALL     0x003F

#define HYST1_HYST0          0x0027
#define HYST1_HYST15         0x002F
#define HYST1_HYST30         0x0037
#define HYST1_HYST45         0x003F

#define CMPPOL1_POL_RISE     0x001F
#define CMPPOL1_POL_FALL     0x003F



/*
 * Memory Segments Sizes
 */

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define ___RESERVED_BASE 0x100
#define ___RESERVED_LENGTH 0x4

#define __AIVT_BASE 0x104
#define __AIVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0x5600

#define __FBS_BASE 0xf80000
#define __FBS_LENGTH 0x2

#define __FGS_BASE 0xf80004
#define __FGS_LENGTH 0x2

#define __FOSCSEL_BASE 0xf80006
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0xf80008
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0xf8000a
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0xf8000c
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0xf8000e
#define __FICD_LENGTH 0x2

#define __FCMP_BASE 0xf80010
#define __FCMP_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x1000

#define __YDATA_BASE 0x1000
#define __YDATA_LENGTH 0x1000
#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x1000

#define __YDATA_BASE 0x1000
#define __YDATA_LENGTH 0x1000
#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x1000

#define __YDATA_BASE 0x1000
#define __YDATA_LENGTH 0x1000


#endif
